<template>
  <div class="wrap">
    <headerVue />
    <div class="big_title container fall-enter-active" v-if="showText">
      <div class="t1">Monad's NFT Legend</div>
      <div class="t2">
        <!-- 在Monad超高速Layer 1区块链的星际引擎驱动下，这里汇聚了最前沿的NFT项目
﻿
每一枚数字资产都如恒星般闪耀，承载着社区的创意与技术的巅峰突破。
﻿
这些NFT不仅展现了并行执行的闪电速度与无与伦比的扩展性，更融入了去中心化梦想的星际蓝图。点击跃入它们的官网与Twitter宇宙，加入这场席卷Web3的星际冒险，点燃你的数字收藏之旅吧！"
﻿ -->
        <span>
          Driven by the interstellar engine of Monad's ultra fast Layer 1
          blockchain, this place gathers the most cutting-edge NFT projects
        </span>
        <span>
          Every digital asset shines like a star, carrying the pinnacle of
          creativity and technological breakthroughs in the community.
        </span>
        <br />
        <span>
          These NFTs not only demonstrate lightning fast parallel execution and
          unparalleled scalability, but also integrate into the interstellar
          blueprint of decentralization dreams. Click to jump into their
          official website and Twitter universe, join this interstellar
          adventure sweeping Web3, and ignite your digital collection journey!
        </span>
      </div>
    </div>
    <div class="all_nft" v-show="showNft">
      <div class="item" v-for="(item, i) in nftList" :key="i" @mouseenter="hoverBox(i)" @mouseleave="resetBox">
        <img class="nft_img" :src="item.avatar_url" alt="" />
        <div :class="`shadow ${moveIndex == i ? 'select_box' : ''}`">
          <div class="nft-name" v-if="moveIndex === i">{{ item.name }}</div>
          <div class="small_logo">
            <a :href="item.twitter || '#'" :target="item.twitter ? '_blank' : null" :class="{ a_hover: item.twitter }"
              @click="!item.twitter && $event.preventDefault()">
              <svg t="1742673219379" class="icon" viewBox="0 0 1024 1024" version="1.1"
                xmlns="http://www.w3.org/2000/svg" p-id="15215" width="40" height="40">
                <path
                  d="M44.928 85.312l362.432 484.672-364.672 394.112h82.048l319.36-344.96 257.92 344.96h279.296l-382.72-512 339.392-366.72h-82.048L561.856 403.008 324.288 85.312H44.928z m120.704 60.48h128.256l566.656 757.76H732.16L165.632 145.856z"
                  p-id="15216" :fill="item.twitter != '' ? '#ffffff' : '#929090'"></path>
              </svg>
            </a>
            <a :href="item.discord_url || '#'" :target="item.discord_url ? '_blank' : null"
              :class="{ a_hover: item.discord_url }" @click="!item.discord_url && $event.preventDefault()">
              <svg t="1742672913599" class="icon" viewBox="0 0 1117 1024" version="1.1"
                xmlns="http://www.w3.org/2000/svg" p-id="10460" width="40" height="40">
                <path
                  d="M1108.66215 815.706125l-3.165079 29.556256-14.894491 12.101774-7.959244 6.469795c-104.35453 84.619329-251.670358 141.916575-374.875728 158.114334l-12.008683 1.58254a55.016527 55.016527 0 0 1-58.972877-36.212232l-60.555416-169.704111a55.714706 55.714706 0 0 1 2.187628-42.821662h-39.935854c6.330159 13.03268 7.633427 28.53226 2.327264 43.287115l-60.508871 169.285203c-8.703968 24.203548-33.000607 39.563492-58.926331 36.165687l-12.055229-1.58254c-123.20537-16.197759-270.521198-73.541551-374.875728-158.114334l-22.80719-18.571569-2.094538-19.083567-1.117086-10.472689c-24.343184-226.210087 3.583987-545.557289 72.191737-727.409719l3.25817-8.750513c8.610878-16.29085 8.610878-16.29085 24.250094-26.437722l8.378151-4.002895C183.109152 17.454482 265.215036 5.119981 389.723674 0h105.145799c38.539496 0 56.226705 38.911859 43.473297 67.490664a1019.62102 1019.62102 0 0 1 48.453642 0.186181C573.810277 39.09804 591.590576 0 630.223163 0h99.188003c122.553736 5.119981 204.659619 17.501027 271.172832 49.105276l8.285061 3.909804c15.965033 10.472689 15.965033 10.472689 24.250093 26.298086l3.397806 8.98324c68.607751 181.85243 96.534922 501.199632 72.191738 727.409719zM839.770037 101.934175l10.519235 5.259617c50.64127 25.27409 22.621009 103.935622-33.745332 88.529133A978.94044 978.94044 0 0 0 558.543423 160.348508c-85.177872 0-171.519376 11.775957-257.209246 35.14169-56.738703 15.359944-84.386602-64.092858-33.140243-88.854949l10.007236-4.84071c-46.545285 5.957797-83.502242 14.754855-113.570496 27.694445-59.857237 166.166668-85.457144 458.843422-64.558311 667.599027 84.479693 65.954669 202.332355 113.105043 302.963262 129.8148l35.234781-98.443278c-85.084782-18.059571-165.468489-55.993978-232.726426-119.807564-37.422409-35.514053-0.465453-100.630907 50.920542-80.709525 5.585434 2.187628 10.239963 4.04944 21.178105 8.517787 23.924277 9.77451 34.443511 13.777404 41.146032 15.453035 64.092858 15.918488 128.883895 25.553362 193.162934 28.671896l92.99748-0.418908a969.86411 969.86411 0 0 0 193.349115-28.252988c6.702521-1.67563 17.314846-5.678525 41.146032-15.453035 10.798506-4.421802 15.546125-6.330159 21.178105-8.517787 51.43254-19.967927 88.342951 45.242017 50.920542 80.75607-67.071756 63.58086-147.548554 101.329086-232.726426 119.388657l35.281326 98.81564c100.630907-16.756303 218.437024-63.906677 302.916717-129.861346 20.898833-208.709059-4.654529-501.339268-64.558311-667.552481-29.975164-12.893044-66.699394-21.690103-112.686136-27.601355zM423.748277 447.300192c4.282166-50.361999-34.908964-91.32185-80.616434-87.039684-34.862419 3.25817-63.906677 33.652241-67.164847 71.865921-4.282166 50.408544 34.815873 91.32185 80.569889 87.039683 34.908964-3.25817 63.953222-33.652241 67.211392-71.86592z m-58.553969 164.584128c-104.726892 9.77451-191.114941-80.616434-181.992065-187.624045 6.981793-82.4317 70.841924-149.177639 151.272177-156.67143 104.726892-9.77451 191.114941 80.569889 181.992066 187.5775-6.981793 82.4317-70.795379 149.177639-151.272178 156.717975zM841.073305 447.300192c4.328712-50.361999-34.815873-91.32185-80.523343-87.039684-34.908964 3.25817-63.953222 33.652241-67.211392 71.865921-4.282166 50.408544 34.815873 91.32185 80.569889 87.039683 34.908964-3.25817 63.906677-33.652241 67.164846-71.86592z m-58.507423 164.584128c-104.726892 9.77451-191.114941-80.616434-181.992066-187.624045 6.981793-82.4317 70.841924-149.177639 151.272177-156.67143 104.726892-9.77451 191.114941 80.569889 181.992066 187.5775-6.981793 82.4317-70.795379 149.177639-151.272177 156.717975z"
                  :fill="item.discord_url != '' ? '#ffffff' : '#929090'" p-id="10461"></path>
              </svg>
            </a>
            <a :href="item.magiceden_url || '#'" :target="item.magiceden_url ? '_blank' : null"
              :class="{ a_hover: item.magiceden_url }" @click="!item.magiceden_url && $event.preventDefault()">
              <svg t="1742673303151" class="icon" viewBox="0 0 1024 1024" version="1.1"
                xmlns="http://www.w3.org/2000/svg" p-id="17132" width="40" height="40">
                <path
                  d="M703.5904 376.23808l53.98528 63.42656c6.18496 7.12704 11.65312 12.98432 13.86496 16.32256 16.13824 16.03584 25.1904 37.72416 25.1904 60.3136-1.51552 26.66496-18.88256 44.81024-34.97984 64.22528l-37.76512 44.35968-19.70176 22.97856a5.38624 5.38624 0 0 0-0.83968 5.89824c0.45056 0.96256 1.18784 1.76128 2.10944 2.29376 0.9216 0.55296 1.96608 0.8192 3.05152 0.77824h196.9152c30.08512 0 67.97312 25.27232 65.76128 63.65184-0.06144 17.44896-7.12704 34.16064-19.64032 46.4896-12.51328 12.32896-29.47072 19.29216-47.16544 19.3536H595.968c-20.29568 0-74.8544 2.19136-90.112-44.3392-3.25632-9.728-3.6864-20.15232-1.29024-30.1056 4.44416-14.72512 11.4688-28.5696 20.74624-40.89856 15.50336-22.97856 32.29696-45.95712 48.8448-68.23936 21.34016-29.184 43.25376-57.4464 64.8192-87.20384 0.75776-0.96256 1.18784-2.17088 1.18784-3.3792 0-1.2288-0.4096-2.41664-1.18784-3.3792l-78.336-91.91424c-0.512-0.67584-1.16736-1.20832-1.92512-1.57696-0.75776-0.36864-1.59744-0.57344-2.43712-0.57344-0.83968 0-1.67936 0.18432-2.43712 0.57344-0.75776 0.36864-1.41312 0.9216-1.92512 1.57696-20.992 27.91424-112.8448 151.552-132.44416 176.59904-19.57888 25.04704-67.85024 26.4192-94.55616 0l-122.53184-121.22112c-0.77824-0.77824-1.78176-1.31072-2.8672-1.51552-1.08544-0.2048-2.21184-0.1024-3.23584 0.3072s-1.90464 1.1264-2.51904 2.02752c-0.6144 0.90112-0.94208 1.98656-0.94208 3.072v233.12384c0.28672 16.54784-4.68992 32.768-14.21312 46.3872-9.5232 13.6192-23.1424 23.9616-38.95296 29.57312a67.76832 67.76832 0 0 1-31.45728 3.01056 67.44064 67.44064 0 0 1-29.36832-11.53024 66.17088 66.17088 0 0 1-20.74624-23.51104c-4.9152-9.35936-7.49568-19.72224-7.51616-30.24896V303.73888c0.69632-15.11424 6.22592-29.61408 15.7696-41.45152a72.966144 72.966144 0 0 1 37.39648-24.49408 75.44832 75.44832 0 0 1 38.66624 0.1024 74.4448 74.4448 0 0 1 33.3824 19.21024l188.39552 185.89696c0.57344 0.57344 1.24928 1.00352 2.00704 1.26976s1.55648 0.38912 2.3552 0.32768c0.79872-0.06144 1.57696-0.3072 2.27328-0.69632 0.69632-0.38912 1.29024-0.94208 1.76128-1.57696l133.8368-182.55872c6.18496-7.41376 13.94688-13.39392 22.71232-17.55136a67.6864 67.6864 0 0 1 28.11904-6.47168h348.11904c9.5232 0.02048 18.944 2.02752 27.60704 5.91872 8.66304 3.8912 16.40448 9.56416 22.67136 16.62976a65.61792 65.61792 0 0 1 13.68064 24.3712c2.74432 8.99072 3.52256 18.45248 2.2528 27.7504-2.4576 16.13824-10.77248 30.86336-23.38816 41.43104a68.990976 68.990976 0 0 1-45.28128 16.01536h-194.92864c-0.98304 0.02048-1.92512 0.3072-2.7648 0.8192-0.83968 0.512-1.51552 1.2288-1.96608 2.08896-0.45056 0.86016-0.65536 1.82272-0.6144 2.78528 0.1024 0.94208 0.4096 1.86368 0.96256 2.68288z"
                  p-id="17133" :fill="item.magiceden_url != '' ? '#ffffff' : '#929090'"></path>
              </svg>
            </a>
          </div>
        </div>
      </div>
    </div>
    <footerVue v-show="showNft" />
  </div>
</template>
<script>
import headerVue from "@/components/header.vue";
import footerVue from "@/components/footer.vue";
import { nftData } from "@/assets/js/nft.js";
import { get_all_nft } from "@/assets/js/draw.js";
export default {
  name: "Allnft",
  components: {
    headerVue,
    footerVue,
  },
  data() {
    return {
      nftList: [],
      moveIndex: -1,
      showText: false,
      showNft: false,
    };
  },
  async created() {
    const data = await get_all_nft()
    if (data.code == 200) {
      this.nftList = data.data
    }
  },
  mounted() {
    window.scrollTo(0, 0);
    this.showText = true;
    setTimeout(() => {
      this.showNft = true;
    }, 500);
  },
  methods: {
    hoverBox(index) {
      this.moveIndex = index;
    },
    resetBox() {
      this.moveIndex = -1;
    },
  },
};
</script>
<style lang="less" scoped>
.wrap {
  padding-top: 100px;

  .container {
    max-width: 1500px;
    margin: 0 auto;
    padding: 0 20px;
    position: relative;
    z-index: 2;
  }

  .big_title {
    margin: 80px auto 50px;
    text-align: center;

    .t1 {
      font-size: 40px;
    }

    .t2 {
      margin-top: 15px;
      font-size: 20px;

      span {
        display: block;
      }
    }
  }

  /* 定义进入动画 */
  .fall-enter-active {
    animation: fallDown 0.5s ease-out;
  }

  /* 定义动画 */
  @keyframes fallDown {
    from {
      transform: translateY(-100vh);
      /* 从上方开始 */
    }

    to {
      transform: translateY(0);
      /* 掉落到最终位置 */
    }
  }

  .all_nft {
    display: flex;
    justify-content: flex-start;
    align-items: center;
    flex-wrap: wrap;
    margin: 0 auto;
    max-width: 1500px;

    .item {
      position: relative;
      margin-right: 10px;
      margin-bottom: 10px;
      width: 360px;
      height: 350px;
      background-color: #fff;
      cursor: pointer;
      transition: scale 0.3s ease;

      &:hover {
        scale: 1.1;
        z-index: 100;
        border-radius: 15px;
        overflow: hidden;
      }

      .nft_img {
        width: 100%;
        height: 100%;
      }

      .shadow {
        position: absolute;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%;
        background-color: rgba(0, 0, 0, 0.7);
        width: 100%;
        height: 100%;
        opacity: 0;
        transition: opacity 0.3s ease;
        z-index: 999;

        .nft-name {
          position: absolute;
          top: 24px;
          left: 24px;
          color: white;
          font-size: 22px;
          font-weight: bold;
          text-shadow: 1px 1px 2px rgba(0, 0, 0, 0.5);
        }

        .small_logo {
          position: absolute;
          bottom: 0;
          left: 0;
          right: 0;
          display: flex;
          justify-content: space-between;
          padding: 30px 50px;

          .a_hover {
            svg:hover {
              path {
                fill: #836ef9;
              }
            }
          }
        }
      }

      .select_box {
        opacity: 0.9;
        shadow: 0 10px 20px rgba(0, 0, 0, 0.3);
      }
    }
  }
}
</style>
